"""
作业1:
北凡用代码表示如下：

北凡 = {
    "语文": 70,
    "数学": 65,
    "英语": 66,
    "生物": 69,
    "政治": 78,
    "跳远": [1.2, 1.3, 1.2]
}

百里的语文成绩比北凡高20，跳远成绩最后一次是1.5，其他成绩与北凡一样
星瑶的语文成绩比北凡高10，其他成绩与北凡一样

用最少的代码完成数据处理，使下面的代码可以同时打印这三个人的成绩
"""
import copy

beifan = {
    "语文": 70,
    "数学": 65,
    "英语": 66,
    "生物": 69,
    "政治": 78,
    "跳远": [1.2, 1.3, 1.2]
}

baili = copy.deepcopy(beifan)
baili["语文"] += 20
baili["跳远"][-1] = 1.5

xingyao = copy.deepcopy(beifan)
xingyao["语文"] += 10

print(f"北凡: {beifan}")
print(f"百里: {baili}")
print(f"星瑶: {xingyao}")