names_list = ['刘亦菲', '张曼玉', '赵丽颖', '杨幂', '刘诗诗', '江疏影']

# 第一种方法：append()添加，默认追加到列表末尾
# 语法格式: 列表.append(元素值)
names_list.append(18)
print(names_list) # ['刘亦菲', '张曼玉', '赵丽颖', '杨幂', '刘诗诗', '江疏影', 18]

# 第二种方法: extend()添加, 默认追加到列表末尾
# 多个数据元素增加
# 语法格式: 列表.extend(多个元素值)
print('---' * 100)
names_list.extend('abcde') # 把'abcde'拆开放入list中
print(names_list) # ['刘亦菲', '张曼玉', '赵丽颖', '杨幂', '刘诗诗', '江疏影', 18, 'a', 'b', 'c', 'd', 'e']

names_list = ['刘亦菲', '张曼玉', '赵丽颖', '杨幂', '刘诗诗', '江疏影']
# 第三种方法：指定索引值插入数据
names_list.insert(1, '杨紫')
print(names_list) # ['刘亦菲', '杨紫', '张曼玉', '赵丽颖', '杨幂', '刘诗诗', '江疏影']