# 需求：去一家商场购物，判断是否为会员
# 是会员：那么全场商品9.5折，消费满200元，立减40元
# 不是会员：就是原价，消费满300元，立减30元

vip = input("请问是否拥有会员卡：（y/n）")
money = eval(input("请输入您消费的金额："))

if vip == 'y':
    print("尊贵的会员您好，您现在购买商场任意商品都可以享受9.5折优惠")
    print("消费满200，立减40")
    if money < 200:
        print(f"只享受95折，最终的结算金额为: {money * 0.95}")
    else:
        print(f"享受95折并且满减，最终的结算金额为: {money * 0.95 - 40}")
else:
    print("消费低于300，不享受任何折扣")
    if money < 300:
        print(f"原价结算，最终结算金额为: {money}")
    else:
        print(f"享受满减活动：{money - 30}")